# pandas

In [3]:
import pandas as pd
import numpy as np

s = pd.Series([1,3,5,np.nan,6,8]) # pandas 의 데이터타입 중에 기초가 되는 것이 Series, 파이썬이 리스트 데이터로 만들 수 있음
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range('20130101', periods=6) # 날짜형 데이터 date_range. 기본 날짜를 지정하고 periods 옵션으로 6일간이라고 지정
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
# DataFrame 유형의 데이터 만들기. 6행4열의 random 변수를 만들고, 컬럼에는 columns=[] 으로 지정하고, index 명령으로 dates 지정
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01 -2.938224  2.018581 -0.114823  0.074584
2013-01-02  0.520483 -0.253102  0.071924 -1.474487
2013-01-03  0.959232  1.915379  1.415279 -1.149126
2013-01-04  0.336907 -0.048627 -0.614405  1.560692
2013-01-05  0.038925 -0.634569  0.281912  1.840765
2013-01-06  1.678686 -1.241969 -2.193668  0.755890

In [6]:
df.head(3)

                   A         B         C         D
2013-01-01 -2.938224  2.018581 -0.114823  0.074584
2013-01-02  0.520483 -0.253102  0.071924 -1.474487
2013-01-03  0.959232  1.915379  1.415279 -1.149126

In [7]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [9]:
df.values

array([[-2.93822392,  2.01858087, -0.11482314,  0.07458386],
       [ 0.52048316, -0.25310194,  0.07192432, -1.47448732],
       [ 0.95923235,  1.91537889,  1.41527906, -1.14912584],
       [ 0.33690678, -0.04862726, -0.61440533,  1.56069173],
       [ 0.03892509, -0.63456932,  0.28191185,  1.84076465],
       [ 1.67868581, -1.24196869, -2.19366843,  0.75589041]])

In [10]:
df.info() # 개요

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [11]:
df.describe() # 통계적 개요 확인

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.099335  0.292615 -0.192297  0.268053
std    1.593612  1.359499  1.189004  1.375834
min   -2.938224 -1.241969 -2.193668 -1.474487
25%    0.113421 -0.539202 -0.489510 -0.843198
50%    0.428695 -0.150865 -0.021449  0.415237
75%    0.849545  1.424377  0.229415  1.359491
max    1.678686  2.018581  1.415279  1.840765

In [12]:
df.sort_values(by='B', ascending=False) # sort_values 명령문은 by 로 지정된 컬럼을 기준으로 정렬. ascending 옵션으로 내림차순 정렬

                   A         B         C         D
2013-01-01 -2.938224  2.018581 -0.114823  0.074584
2013-01-03  0.959232  1.915379  1.415279 -1.149126
2013-01-04  0.336907 -0.048627 -0.614405  1.560692
2013-01-02  0.520483 -0.253102  0.071924 -1.474487
2013-01-05  0.038925 -0.634569  0.281912  1.840765
2013-01-06  1.678686 -1.241969 -2.193668  0.755890

In [13]:
df

                   A         B         C         D
2013-01-01 -2.938224  2.018581 -0.114823  0.074584
2013-01-02  0.520483 -0.253102  0.071924 -1.474487
2013-01-03  0.959232  1.915379  1.415279 -1.149126
2013-01-04  0.336907 -0.048627 -0.614405  1.560692
2013-01-05  0.038925 -0.634569  0.281912  1.840765
2013-01-06  1.678686 -1.241969 -2.193668  0.755890

In [14]:
df['A']

2013-01-01   -2.938224
2013-01-02    0.520483
2013-01-03    0.959232
2013-01-04    0.336907
2013-01-05    0.038925
2013-01-06    1.678686
Freq: D, Name: A, dtype: float64

In [15]:
df[0:3]

                   A         B         C         D
2013-01-01 -2.938224  2.018581 -0.114823  0.074584
2013-01-02  0.520483 -0.253102  0.071924 -1.474487
2013-01-03  0.959232  1.915379  1.415279 -1.149126

In [16]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.520483 -0.253102  0.071924 -1.474487
2013-01-03  0.959232  1.915379  1.415279 -1.149126
2013-01-04  0.336907 -0.048627 -0.614405  1.560692

In [17]:
df.loc[dates[0]] # location 옵션으로 슬라이싱

A   -2.938224
B    2.018581
C   -0.114823
D    0.074584
Name: 2013-01-01 00:00:00, dtype: float64

In [19]:
df.loc[:,['A','B']] # A, B 열의 모든 행

                   A         B
2013-01-01 -2.938224  2.018581
2013-01-02  0.520483 -0.253102
2013-01-03  0.959232  1.915379
2013-01-04  0.336907 -0.048627
2013-01-05  0.038925 -0.634569
2013-01-06  1.678686 -1.241969

In [20]:
df.loc['20130102':'20130104', ['A','B']]

                   A         B
2013-01-02  0.520483 -0.253102
2013-01-03  0.959232  1.915379
2013-01-04  0.336907 -0.048627

In [22]:
df.loc['20130102', ['A','B']]

A    0.520483
B   -0.253102
Name: 2013-01-02 00:00:00, dtype: float64

In [23]:
df.loc[dates[0], 'A']

-2.9382239227970834

In [24]:
df.iloc[3] # 3번째 행 = 4행

A    0.336907
B   -0.048627
C   -0.614405
D    1.560692
Name: 2013-01-04 00:00:00, dtype: float64

In [25]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.336907 -0.048627
2013-01-05  0.038925 -0.634569

In [26]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02  0.520483  0.071924
2013-01-03  0.959232  1.415279
2013-01-05  0.038925  0.281912

In [27]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.520483 -0.253102  0.071924 -1.474487
2013-01-03  0.959232  1.915379  1.415279 -1.149126

In [28]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  2.018581 -0.114823
2013-01-02 -0.253102  0.071924
2013-01-03  1.915379  1.415279
2013-01-04 -0.048627 -0.614405
2013-01-05 -0.634569  0.281912
2013-01-06 -1.241969 -2.193668

In [29]:
df

                   A         B         C         D
2013-01-01 -2.938224  2.018581 -0.114823  0.074584
2013-01-02  0.520483 -0.253102  0.071924 -1.474487
2013-01-03  0.959232  1.915379  1.415279 -1.149126
2013-01-04  0.336907 -0.048627 -0.614405  1.560692
2013-01-05  0.038925 -0.634569  0.281912  1.840765
2013-01-06  1.678686 -1.241969 -2.193668  0.755890

In [30]:
df[df.A > 0] # A 컬럼에서 0보다 큰 행만 얻는 것

                   A         B         C         D
2013-01-02  0.520483 -0.253102  0.071924 -1.474487
2013-01-03  0.959232  1.915379  1.415279 -1.149126
2013-01-04  0.336907 -0.048627 -0.614405  1.560692
2013-01-05  0.038925 -0.634569  0.281912  1.840765
2013-01-06  1.678686 -1.241969 -2.193668  0.755890

In [31]:
df[df > 0] # 데이터 전체에서 조건을 걸면 만족하지 않은 곳은 NaN 처리가 됨

                   A         B         C         D
2013-01-01       NaN  2.018581       NaN  0.074584
2013-01-02  0.520483       NaN  0.071924       NaN
2013-01-03  0.959232  1.915379  1.415279       NaN
2013-01-04  0.336907       NaN       NaN  1.560692
2013-01-05  0.038925       NaN  0.281912  1.840765
2013-01-06  1.678686       NaN       NaN  0.755890

In [32]:
df2 = df.copy() # 데이터프레임 복사

In [34]:
df2['E'] = ['one','one','two','three','four','three'] # 새로운 컬럼 추가
df2

                   A         B         C         D      E
2013-01-01 -2.938224  2.018581 -0.114823  0.074584    one
2013-01-02  0.520483 -0.253102  0.071924 -1.474487    one
2013-01-03  0.959232  1.915379  1.415279 -1.149126    two
2013-01-04  0.336907 -0.048627 -0.614405  1.560692  three
2013-01-05  0.038925 -0.634569  0.281912  1.840765   four
2013-01-06  1.678686 -1.241969 -2.193668  0.755890  three

In [44]:
df2['E'].isin(['two','four']) # 특정 원소가 있는지 조건을 걸고 싶을 때 isin(). 결과는 True, False 로 반환

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [43]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.959232  1.915379  1.415279 -1.149126   two
2013-01-05  0.038925 -0.634569  0.281912  1.840765  four

In [45]:
df

                   A         B         C         D
2013-01-01 -2.938224  2.018581 -0.114823  0.074584
2013-01-02  0.520483 -0.253102  0.071924 -1.474487
2013-01-03  0.959232  1.915379  1.415279 -1.149126
2013-01-04  0.336907 -0.048627 -0.614405  1.560692
2013-01-05  0.038925 -0.634569  0.281912  1.840765
2013-01-06  1.678686 -1.241969 -2.193668  0.755890

In [46]:
df.apply(np.cumsum) # apply() 특정함수 적용

                   A         B         C         D
2013-01-01 -2.938224  2.018581 -0.114823  0.074584
2013-01-02 -2.417741  1.765479 -0.042899 -1.399903
2013-01-03 -1.458508  3.680858  1.372380 -2.549029
2013-01-04 -1.121602  3.632231  0.757975 -0.988338
2013-01-05 -1.082677  2.997661  1.039887  0.852427
2013-01-06  0.596009  1.755693 -1.153782  1.608318

In [47]:
df.apply(lambda x: x.max() - x.min()) # 최대값과 최소값의 차이

A    4.616910
B    3.260550
C    3.608947
D    3.315252
dtype: float64

## pandas 고급기능 : 두 데이터 프레임 병합하기

In [49]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[8, 9, 10, 11])

In [50]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [51]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [52]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [53]:
# concat() :  데이터를 열방향으로 단순히 합치는 것

result = pd.concat([df1, df2, df3])
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [54]:
# 단순하게 아무 옵션없이 그냥 사용하면 열 방향으로 병합. key 옵션으로 구분하면 다중 index 가 되어 level 을 형성

result = pd.concat([df1,df2, df3], keys = ['x','y','z'])
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [55]:
result.index

MultiIndex(levels=[['x', 'y', 'z'], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]],
           labels=[[0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]])